; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	Star10 - direction
	GroundStation11 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star2 - direction
	Star6 - direction
	GroundStation9 - direction
	GroundStation3 - direction
	Star0 - direction
	Star5 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation11)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation9)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(pointing satellite1 Star2)
	(pointing satellite4 GroundStation7)
	(have_image Star12 infrared1)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Phenomenon15 spectrograph0)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite0 star6 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star6)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet16 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet16)
   goals met: 0 of 8
5. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 1 of 8
6. (turn_to satellite0 planet13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet13)
   goals met: 1 of 8
7. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon15 instrument0 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 3 of 8
10. (turn_to satellite0 star12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star12)
   goals met: 3 of 8
11. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 4 of 8
12. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
13. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 5 of 8
14. (turn_to satellite0 groundstation8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 8
15. (turn_to satellite1 star2 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star2)
   goals met: 7 of 8
16. (turn_to satellite4 groundstation7 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation7)
   goals met: 8 of 8
